const AboutCompany = () => {
    return (
        <div className="max-w-3xl mx-auto p-6 h-screen-with-footer">
            <h1 className="text-3xl font-bold mb-4">Про компанію</h1>
            <p className="mb-4">
                Наша компанія спеціалізується на продажу електротехніки вже
                понад 10 років. Ми пропонуємо широкий асортимент продукції від
                провідних світових виробників, гарантуючи високу якість та
                надійність кожного товару.
            </p>
            <p>
                Ми прагнемо забезпечити найкращий сервіс для наших клієнтів,
                надаючи професійні консультації та підтримку на кожному етапі
                покупки. Ваша задоволеність є нашим головним пріоритетом.
            </p>
        </div>
    );
};

export default AboutCompany;
