const PublicOffer = () => {
    return (
        <div className="max-w-3xl mx-auto p-6 h-screen-with-footer">
            <h1 className="text-3xl font-bold mb-4">Публічна оферта</h1>
            <p className="mb-4">
                Придбання товарів у нашому інтернет-магазині здійснюється на
                підставі публічної оферти. Це означає, що кожен покупець,
                оформляючи замовлення, погоджується з умовами продажу,
                викладеними на нашому сайті.
            </p>
            <p>
                Публічна оферта включає всі необхідні правові аспекти, такі як
                правила доставки, оплати та повернення товару. Ми рекомендуємо
                уважно ознайомитися з нею перед оформленням замовлення.
            </p>
        </div>
    );
};

export default PublicOffer;
