const Installation = () => {
    return (
        <div className="max-w-3xl mx-auto p-6 h-screen-with-footer">
            <h1 className="text-3xl font-bold mb-4">Установка</h1>
            <p className="mb-4">
                Наша компанія пропонує послуги з професійної установки придбаної
                електротехніки. Наші фахівці мають великий досвід та необхідні
                сертифікати для проведення будь-яких робіт.
            </p>
            <p>
                Ми гарантуємо швидку та якісну установку, враховуючи всі вимоги
                безпеки та рекомендації виробників. Звертайтеся до нас, щоб
                забезпечити правильну та безпечну роботу вашої техніки.
            </p>
        </div>
    );
};

export default Installation;
