const Warranty = () => {
    return (
        <div className="max-w-3xl mx-auto p-6 h-screen-with-footer">
            <h1 className="text-3xl font-bold mb-4">Гарантія</h1>
            <p className="mb-4">
                Всі товари, які продаються в нашому інтернет-магазині, мають
                офіційну гарантію від виробника. Термін гарантії залежить від
                конкретного товару та зазначений в супровідних документах.
            </p>
            <p>
                Ми також надаємо післягарантійне обслуговування та підтримку,
                щоб ви могли бути впевнені в надійності та довговічності вашої
                техніки. Для отримання гарантійного обслуговування звертайтеся
                до нашого сервісного центру.
            </p>
        </div>
    );
};

export default Warranty;
