const Credit = () => {
    return (
        <div className="max-w-3xl mx-auto p-6 h-screen-with-footer">
            <h1 className="text-3xl font-bold mb-4">Кредит</h1>
            <p className="mb-4">
                Ми пропонуємо вигідні умови кредитування для придбання
                електротехніки. Співпрацюємо з провідними банками, щоб
                забезпечити вам найкращі умови та мінімальні відсоткові ставки.
            </p>
            <p>
                Оформлення кредиту відбувається безпосередньо на нашому сайті
                або в магазині, що займає мінімум часу. Наші менеджери
                допоможуть вам підібрати оптимальний варіант кредитування
                відповідно до ваших потреб та можливостей.
            </p>
        </div>
    );
};

export default Credit;
