const InformationCenter = () => {
    return (
        <div className="max-w-3xl mx-auto p-6 min-h-screen">
            <h1 className="text-3xl font-bold mb-6">Довідковий центр</h1>
            <section className="mb-6">
                <h2 className="text-2xl font-semibold mb-2">
                    Часті запитання (FAQ)
                </h2>
                <p className="mb-4">
                    Тут ви знайдете відповіді на найбільш поширені питання, що
                    стосуються нашого інтернет-магазину та його роботи. Якщо у
                    вас виникли питання, які не висвітлені в цьому розділі, будь
                    ласка, звертайтеся до нашої служби підтримки.
                </p>
            </section>

            <section className="mb-6">
                <h2 className="text-2xl font-semibold mb-2">
                    Як зробити замовлення?
                </h2>
                <p className="mb-4">
                    {`
                    Для того, щоб зробити замовлення, виберіть потрібний товар і
                    додайте його до кошика. Після цього перейдіть до кошика і
                    натисніть кнопку "Оформити замовлення". Введіть необхідні
                    дані для доставки та оплати, після чого підтвердіть
                    замовлення `}
                </p>
            </section>

            <section className="mb-6">
                <h2 className="text-2xl font-semibold mb-2">
                    Як відстежити замовлення?
                </h2>
                <p className="mb-4">
                    Після оформлення замовлення ви отримаєте підтвердження на
                    електронну пошту з номером для відстеження. Використовуйте
                    цей номер на сайті служби доставки для отримання інформації
                    про статус вашого замовлення.
                </p>
            </section>

            <section className="mb-6">
                <h2 className="text-2xl font-semibold mb-2">
                    Повернення та обмін
                </h2>
                <p className="mb-4">
                    {`Якщо вам необхідно повернути або обміняти товар, будь ласка,
                    зв'яжіться з нашою службою підтримки протягом 14 днів з
                    моменту отримання товару. Ми допоможемо вам оформити
                    повернення або обмін згідно з нашими правилами та умовами.`}
                </p>
            </section>

            <section>
                <h2 className="text-2xl font-semibold mb-2">
                    Контакти служби підтримки
                </h2>
                <p className="mb-4">
                    {`Якщо у вас є будь-які питання або потребуєте допомоги, будь
                    ласка, зв'яжіться з нашою службою підтримки. Ми доступні з
                    понеділка по п'ятницю з 9:00 до 18:00.`}
                </p>
                <ul>
                    <li className="mb-2">
                        <strong>Email:</strong> support@electroshop.com
                    </li>
                </ul>
            </section>
        </div>
    );
};

export default InformationCenter;
